 <template>
      <div class="main-content">
        <p>桥好吧云平台服务协议</p>
        <p>版本生效日期：2017年08月21日</p>
        <p>提示条款</p>
        <p>欢迎您签署本《桥好吧平台服务协议》（下称“本协议”）并使用桥好吧平台服务！</p>
        <p>服务条款前所列索引关键词仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。</p>
        <p>【审慎阅读】您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体下划线标识，您应重点阅读。如您对协议有任何疑问，可向桥好吧平台客服咨询。
        </p>
        <p>【签约动作】当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与桥好吧达成一致，成为桥好吧平台“用户”。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。
        </p>
        <p>一、 定义</p>
        <p>桥好吧平台：指包括桥好吧网（域名为 www.qiaohaoba.net）网站及客户端。</p>
        <p>桥好吧：桥好吧平台经营者的单称或合称，包括桥好吧网经营者江苏中桥信息技术有限公司。</p>
        <p>桥好吧平台服务：桥好吧基于互联网，以包含桥好吧平台网站、客户端等在内的各种形态（包括未来技术发展出现的新的服务形态）向您提供的各项服务。</p>
        <p>桥好吧平台规则：包括在所有桥好吧平台规则频道内已经发布及后续发布的全部规则、解读、公告等内容以及各平台在帮派、论坛、帮助中心内发布的各类规则、实施细则、产品流程说明、公告等。</p>
        <p>开发者：指经有效注册并通过认证，将其或其公司企业生产的硬件设备，或开发的软件应用接入并使用桥好吧平台对其产品进行远程控制、监控等操作，具备民事行为能力的个人、法人或组织。</p>
        <p>用户：指使用开发者接入桥好吧平台的硬件设备使用者、软件应用使用者。</p>
        <p>数据：指开发者手动上传，或通过传感器自动上传的数据。</p>
        <p>二、开发者的权利和义务</p>
        <p> 2.1 注册认证</p>
        <p> 开发者使用桥好吧平台需要登录开发者账号。通过公测申请获得账号的开发者，务必及时登录修改密码和更新个人信息。如果由于开发者未及时修改密码造成损失的，由开发者单方承担。通过注册获得账号的开发者，务必保证注册信息真实、准确和完整，并在资料变更时及时更新相关信息。对于任何信息不实所导致开发者本人或用户的损害，江苏中桥不承担任何责任。开发者应妥善保管个人注册信息及登录密码等资料，并对以其注册用户名进行的所有活动和时间负法律责任。
        </p>
        <p> 2.2 接入产品所有权和使用权</p>
        <p> 开发者在使用桥好吧平台时，必须对其接入的硬件设备，或软件应用具备法律上的所有权或使用权。经审核若然开发者存在窃用第三方产品的，江苏中桥将有权取消开发者继续使用桥好吧平台接入服务，终止本条款，并保留追究开发者法律责任的权利。若然造成开发者本人或用户损害、纠纷的，江苏中桥不承担任何责任。若然造成桥好吧平台名誉及实质损害的，江苏中桥将保留追究开发者法律责任的权利。
        </p>
        <p> 2.3 正确使用集成过程</p>
        <p> 开发者使用桥好吧平台前务必熟知开发流程，正确使用完成系统集成过程。若因个人操作不当，造成个人第三方损害的，江苏中桥不承担任何责任。若然造成桥好吧平台名誉及实质损害的，江苏中桥将保留追究开发者法律责任的权利。开发者务必合法使用桥好吧平台授予其应用的
            AppKey，不得违反本条款宗旨用于其他目的，不得授予其他单位户或个人使用。对开发者因被他人冒用所致损失，江苏中桥不承担任何责任，并且开发者必须就该AppKey项下之一切活动承担全部责任。如因以上过失，对桥好吧平台造成名誉或实质损害的，江苏中桥将保留追究开发者法律责任的权利。
        </p>
        <p> 2.4 基本原则</p>
        <p> 开发者将第三方应用接入桥好吧平台，江苏中桥不涉足其业务、功能逻辑的实现，和数据、内容审核义务。开发者需要对接入的第三方应用承担一切的责任，必须保证以下基本原则：</p>
        <p> （1）不得上传、发布、传播、存储违反宪法、国家法律法规禁止的，危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的，煽动民族仇恨、破坏民族团结的，宣扬邪教封建迷信、迫害宗教政策的，扰乱社会秩序、破坏社会未定的内容。
        </p>
        <p> （2）不得在设备查看等页面宣传与其应用无关的任何其他信息，如广告、非法信息宣传等。也不得发布涉及他人隐私，侵犯他人名誉权、肖像权、商业秘密、知识产权等内容。</p>
        <p> （3）未经江苏中桥书面许可，开发者不得模仿和使用江苏中桥或桥好吧平台任何商业标识或近似的产品标识。也不得公开表达或暗示，开发者与江苏中桥存在合作关系，包括但不限于相互持股、商业往来或合作关系等，或声称江苏中桥对开发者的认可。对于有意无意造成用户混淆的行为，江苏中桥有权要求开发者修改，暂停或终止服务，并保留追究其法律责任的权利。
        </p>
        <p> （4）开发者拥有依照本条款约定合法使用桥好吧平台开放
            API的权利，但不得向任何单位或个人出售转让或转授权桥好吧平台的代码、API及开发工具等。也不得通过包括但不限于赠送、发售等方式使用和江苏中桥有直接竞争关系的公司的产品或品牌服务等，如因开发者违反此条款给用户或江苏中桥造成任何损失的，开发者应当赔偿损失，并承担相应的法律责任。
        </p>
        <p> （5）开发者同意接收来自江苏中桥发出的邮件、信息，包括但不限于关于用户利益、商业推广的信息等；开发者如需向江苏中桥进行通知，应当通过江苏中桥对外正式公布的通信地址、电子邮件地址等联系信息送达。</p>
        <p> （6）开发者应对其产品的设计、开发、测试、维护、生产等工序负责，并承担应有的成本。如需江苏中桥提供有偿服务，需提交书面申请和详细的需求文档，依照双方额外签订的协议执行。</p>
        <p>三、江苏中桥的权利和义务</p>
        <p> 3.1江苏中桥对接入或即将接入桥好吧平台的开发者提供详尽的系统解说义务。包括但不仅限于，系统的功能与使用，系统免费与付费模块等。同时为开发者提供有效及时的咨询服务，和可行的技术支持。</p>
        <p> 3.2江苏中桥有权审查开发者是否具备合法的接入桥好吧平台的资格，上传的数据是否合法。</p>
        <p> 3.3江苏中桥拥有合作过程中涉及到的桥好吧平台的所有服务内容知识产权，以及品牌、知识产权在合作过程中所产生的衍生品的全部合法权益。</p>
        <p> 3.4开发者因违反相关法律法规而被取缔运营，或因违规操作被网络监管部门查封所引发的全部责任，由开发者独立承担。情节严重并给江苏中桥带来不利影响的，开发者须赔偿江苏中桥所有损失，并恢复桥好吧平台声誉，此情况下江苏中桥有权单方终止本条款。
        </p>
        <p> 3.5如发现开发者有违法行为，或其上传的用户数据中包含违法信息或可能侵犯他人合法权益的信息，无论是否已造成不良后果，江苏中桥均有权要求开发者立即停止违法行为或更换、修改违法内容，或者单方终止本服务协议，并且有权要求开发者赔偿由此给江苏中桥造成的损失。
        </p>
        <p> 3.6如发生下列任一情形，江苏中桥有权以普通或非专业人员的知识水平标准对相关内容进行判别，如认为这些内容或行为具有不合理或违法的情形，江苏中桥有权删除相关信息，或终止或暂停对该开发者提供服务。</p>
        <p> （1）其他第三方对某个开发者或具体事项持有异议并书面通知江苏中桥；</p>
        <p> （2）其他第三方向江苏中桥书面告知桥好吧平台上有违法或不当情形的。</p>
        <p> 3.7江苏中桥可将本条款下的权利和义务的部分或全部转让给他人，如果开发者不同意江苏中桥的该转让，则有权停止使用本条款下服务。如果开发者和平台用户继续使用，则视为开发者和平台用户对此转让予以接受。</p>
        <p> 3.8开发者违反平台使用规则时，江苏中桥有权依照江苏中桥的认识判断决定并采取以下行动，终止与开发者的服务协议关系，以及其他认为适合的处理方式。</p>
        <p> 3.9江苏中桥可通过网页公告、电子邮件、手机短信或常规的信件传送等方式向开发者发出通知，该等通知在发送时即视为已送达收件人。</p>
        <p>四、知识产权条款</p>
        <p> 4.1桥好吧平台上所有内容，均由或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。非经江苏中桥或其他权利人书面同意任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表桥好吧平台上的内容。
        </p>
        <p> 4.2开发者应在其数据服务中向相关权利人提供知识产权投诉途径，确保权利人可以向开发者主张权利。</p>
        <p>五、隐私相关条款</p>
        <p>江苏中桥重视对开发者及平台用户隐私的保护，保护隐私是江苏中桥的一项基本政策。如发生下列任一情况，江苏中桥有权对开发者的信息予以披露：</p>
        <p>（1）经开发者本人同意披露的；</p>
        <p>（2）根据法律的有关规定，应相关第三人、行政机构或司法机构的要求，需要向其披露的；</p>
        <p>（3）开发者出现违反中国有关法律、法规、规章、政策的情形，需要向他人披露的；</p>
        <p>（4）江苏中桥基于为开发者和平台用户服务的目的而认为合适披露的其他情形；详细的隐私相关条款请看我们的《隐私政策》。</p>
        <p>六、服务暂停或终止</p>
        <p> 6.1开发者应确保自身在注册时填写的姓名（名称）、地址、电子邮箱等相关资料真实、准确，若有更新的，开发者应在三个工作日内予以更新，如江苏中桥发现其不真实或不准确的，江苏中桥有权暂停或终止向其提供本条款下服务由此产生的一 ,
            切法律责任由开发者自行承担。</p>
        <p> 6.2如开发者书面通知江苏中桥不接受经江苏中桥修改的新的服务协议的，江苏中桥有权随时暂停或终止向其提供本条款下服务。</p>
        <p> 6.3本条款约定的其他协议终止条件发生或实现的，江苏中桥有权随时暂停或终止向开发者提供本条款下服务。</p>
        <p> 6.4在开发者违反本条款规定时，江苏中桥有权随时暂停或终止向该开发者提供部分或全部开放平台服务。如该开发者后续再直接或间接或以他人名义注册并登录桥好吧平台的，江苏中桥有权直接单方面暂停或终止提供本条款下服务。</p>
        <p> 6.5在合作期限内，因不可抗力因素导致授权程序无法继续运营的，双方可协商终止协议。</p>
        <p> 6.6如本条款服务终止，江苏中桥有权保留或删除开发者账号中的任何信息，且有权拒绝将该信息发还给开发者，也有权保存或删除开发者的全部相关数据，包括服务终止前开发者尚未完成的任何数据。</p>
        <p> 6.7在开发者存在违反法律法规或国家相关政策规定时，江苏中桥有权随时暂停或终止向该开发者提供部分或全部开放平台服务。如该开发者后续再直接或间接（如以他人名义）注册并登录桥好吧平台的，江苏中桥有权直接单方面暂停或终止提供本条款下服务。
        </p>
        <p>七、协议内容修改</p>
        <p> 7.1本条款内容包括协议正文及所有江苏中桥已经发布的或将来可能发布的桥好吧平台相关规则。上述规则为本条款不可分割的一部分，与本条款正文具有同等法律效力。</p>
        <p> 7.2江苏中桥有权根据需要不时地制订、修改本条款或各类规则，且毋须另行通知。其一旦发生变动，江苏中桥将会在相关页面上公布修改后的协议或规则，如果开发者不同意所改动的内容，应主动取消服务，如果继续使用服务，则视为接受协议或规则的变动。除另行明确声明外，任何使服务“
            范围扩大 ” 或功能增强的新内容均受本条款约束。</p>
        <p>八、免责事由</p>
        <p> 8.1鉴于网络服务的特殊性，开发者同意江苏中桥会变更、中断部分或全部的网络服务，并删除开发者在使用服务中提s交的任何资料，而无需通知开发者，也无需承担任何责任。</p>
        <p> 8.2江苏中桥有权定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成网络服务在一定时间内的中断或暂停，江苏中桥无需为此承担任何责任。</p>
        <p> 8.3如发生下述任一情况而导致服务中断及开发者损失的，江苏中桥不承担责任，该状况包括但不限于：</p>
        <p> （1）发生台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力情形的；</p>
        <p> （2）由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟、计算机病毒侵入或发作的；</p>
        <p> （3）计算机系统遭到破坏、瘫痪或无法正常使用的；</p>
        <p> （4）电信设备出现故障不能进行数据传输的；</p>
        <p> （5）因政府管制而造成暂时性关闭的；</p>
        <p> （6）其它非因江苏中桥的过错而引起的。</p>
        <p>九、本条款的解释、法律适用及争端解决</p>
        <p> 9.1江苏中桥对本条款条款拥有解释权。</p>
        <p> 9.2本条款的有效性、履行和与本条款及其修订本效力有关的所有事宜，将受中华人民共和国大陆法律管辖，任何争议仅适用中华人民共和国大陆法律。</p>
    </div>
 </template>
 
 <script>
 export default {
     props: {
 
     },
     data() {
         return {
 
         };
     },
     computed: {
 
     },
     created() {
 
     },
     mounted() {
 
     },
     watch: {
 
     },
     methods: {
 
     },
     components: {
 
     },
 };
 </script>
 
 <style scoped lang="scss">
    .main-content {
        padding: 0.2rem;
        p {
          margin-bottom: 16px;
        }
    }
 </style>
 